<a href="https://colab.research.google.com/github/JonathanJuradoS/UTP-IA-2025/blob/main/03_05_Groupby.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

___

<a href='https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.groupby.html'> <img src='https://www.python.org/static/img/python-logo.png' /></a>
___

# Groupby

El método **groupby** le permite agrupar filas de datos y llamar a funciones agregadas

In [ ]:
import pandas as pd
# Creamos un dataframe
data = {'Empresa':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Persona':['Luis','Juan','Oscar','Rosa','Jorge','Esteban'],
       'Ventas':[200,120,340,124,243,350]}

In [ ]:
df = pd.DataFrame(data)

In [ ]:
df

  Empresa  Persona  Ventas
0    GOOG     Luis     200
1    GOOG     Juan     120
2    MSFT    Oscar     340
3    MSFT     Rosa     124
4      FB    Jorge     243
5      FB  Esteban     350

**Ahora se puede usar el método .groupby () para agrupar filas basándose en el nombre de una columna. Por ejemplo, agrupemos en función de la empresa. Esto creará un objeto DataFrameGroupBy:**

In [ ]:
df.groupby('Empresa')

Puedes guardar este objeto como una nueva variable:

In [ ]:
by_emp = df.groupby("Empresa")

Y luego llamar a los métodos agregados fuera del objeto:

In [ ]:
by_emp.mean()

         Ventas
Empresa
FB        296.5
GOOG      160.0
MSFT      232.0

In [ ]:
df.groupby('Empresa').mean()

         Ventas
Empresa
FB        296.5
GOOG      160.0
MSFT      232.0

Más ejemplos de métodos agregados:

In [ ]:
by_emp.std()

             Ventas
Empresa
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [ ]:
by_emp.min()

         Persona  Ventas
Empresa
FB       Esteban     243
GOOG        Juan     120
MSFT       Oscar     124

In [ ]:
by_emp.max()

        Persona  Ventas
Empresa
FB        Jorge     350
GOOG       Luis     200
MSFT       Rosa     340

In [ ]:
by_emp.count()

         Persona  Ventas
Empresa
FB             2       2
GOOG           2       2
MSFT           2       2

In [ ]:
by_emp.describe()

        Ventas
         count   mean         std    min     25%    50%     75%    max
Empresa
FB         2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG       2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT       2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [ ]:
by_emp.describe().transpose()

Empresa               FB        GOOG        MSFT
Ventas count    2.000000    2.000000    2.000000
       mean   296.500000  160.000000  232.000000
       std     75.660426   56.568542  152.735065
       min    243.000000  120.000000  124.000000
       25%    269.750000  140.000000  178.000000
       50%    296.500000  160.000000  232.000000
       75%    323.250000  180.000000  286.000000
       max    350.000000  200.000000  340.000000

In [ ]:
by_emp.describe().transpose()['GOOG']

Ventas  count      2.000000
        mean     160.000000
        std       56.568542
        min      120.000000
        25%      140.000000
        50%      160.000000
        75%      180.000000
        max      200.000000
Name: GOOG, dtype: float64

# Buen trabajo!